<?php
/**
 * 9开头表示模块 模块编号 信息编号4位 0001
 */
return [
    // query request 公共参数方面
    40001 => '请求的数据不存在',
    40002 => '{0}参数异常',
    40003 => '此数据没有操作权限',
    40004 => '操作失败，请重试',
    40005 => '未登录',
    40006 => '账号或密码错误',

    // 入口错误代码
    50001 => 'TOKEN无效',
    50002 => '生成TOKEN错误',
    50003 => 'access-token无效',
    50004 => '未授权访问, 联系管理员',
    50005 => '无效请求',
    50006 => '查询参数不合法',
    50007 => '无效登录', // 后台非管理员登录

    // 文件操作错误代码
    51001 => '总数|分片数错误',
    51002 => '分片{0}上传失败',
    51003 => '未上传文件',

    // 基础功能模块
    910001 => '无效的参数设置',


    // rbac模块 2
    920001 => '请刷新验证码',
    920002 => '验证码错误',
    920003 => '非法操作,验证码无效',
    920004 => '你有短信验证码未使用，有效时间内平台通用',
    920005 => '短信发送失败',
    // spu模块  3
    930001 => '已评论或订单不存在',
    930002 => '未购买此商品',
    930003 => '商品不存在或已下架',
    // cms模块 4
    // order模块 5
    950001 => '单品或购物车数据无效',
    950002 => '该支付方式未配置',
    950003 => '用户微信消息不存在',
    // payment模块 6
    // shop模块 7
    // member模块 8
    980001 => '小程序获取sessionKey',
    980002 => '小程序新增用户失败',
    980003 => '微信配置错误',
    980004 => '小程序sessionkey错误',
    980005 => '小程序解码错误',
    980006 => '发送成功',
    980007 => '发送失败',
    980008 => '验证码 {0} ',
    980009 => '验证码不正确 ',
    // promotion模块 9
    990001 => '优惠券已经领取',
    990002 => '优惠券未到使用时间',
    990003 => '优惠券过期',
    990004 => '优惠券已使用',
    990005 => '优惠券不可同时使用',
    990006 => '优惠券已暂停发放',
    990007 => '优惠券状态不正确',
    990008 => '优惠券未审核',
    990009 => '优惠券待审核',


    'This email address has already been taken.' => '邮箱已注册',
    'This username has already been taken.' => '用户名已注册',
    'This phone has already been taken.' => '手机号已注册',

    400001 => '未实名认证',
];
